In [155]:
# in this section, I will learn how to slice , dice data.
#Get and subsets of panda objects.

# [] is python and numpy indexing operator 
# attribute operator

In [156]:
# Different Choices of Indexing
## pandas support three types of multi axis indexing:
### .loc- label based  and allowed inputs are;
##### a single label (5, 'a')
##### a list or array ['a', 'b', 'c']
##### a slice object with labels 'a':'f' - both the start and the index stop are included
##### a bolean array
##### a callable function with one argument

In [157]:
# Different Choices of Indexing
## pandas support three types of multi axis indexing:
### .iloc- integer position based  and allowed inputs are;
##### an integer eg 5 
##### a list of array [4,3,0]
##### a slice object with ints 1:7
##### a bolean array
##### a callable function

In [158]:
# if object type is Series the indexer will be s.loc[indexer]
# if object type is Data frmae the indexer is df.loc[row_indexer, column_indexer]
# if object is panel p.loc[item-indexer, major_indexor, Minor_indexor]

In [159]:
import pandas as pd
import numpy as np

In [160]:
dates=pd.date_range('1/1/2000',periods=8)

In [161]:
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])

In [162]:
df

                   A         B         C         D
2000-01-01  0.791700 -0.685189  0.477730  0.468455
2000-01-02  0.198320 -1.191320 -1.319135 -2.081609
2000-01-03  0.655858  1.313179 -0.040808 -1.568859
2000-01-04  0.050410  1.363315  0.425948 -0.601308
2000-01-05 -1.718382  3.023672 -1.164024 -0.370949
2000-01-06  0.231959  0.913475  0.414393  0.503472
2000-01-07 -1.042249  0.670385  0.475680  0.487484
2000-01-08  1.803062 -1.272377 -0.248261 -0.509408

In [163]:
panel=pd.Panel({'one':df, 'two':df-df.mean()})

In [164]:
panel

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 8 (major_axis) x 4 (minor_axis)
Items axis: one to two
Major_axis axis: 2000-01-01 00:00:00 to 2000-01-08 00:00:00
Minor_axis axis: A to D

In [165]:
s=df['A']

In [166]:
s

2000-01-01    0.791700
2000-01-02    0.198320
2000-01-03    0.655858
2000-01-04    0.050410
2000-01-05   -1.718382
2000-01-06    0.231959
2000-01-07   -1.042249
2000-01-08    1.803062
Freq: D, Name: A, dtype: float64

In [167]:
s[dates[5]]

0.23195913214209213

In [168]:
panel['two']

                   A         B         C         D
2000-01-01  0.670365 -1.202082  0.600039  0.927545
2000-01-02  0.076985 -1.708212 -1.196826 -1.622519
2000-01-03  0.534523  0.796286  0.081502 -1.109769
2000-01-04 -0.070924  0.846423  0.548257 -0.142218
2000-01-05 -1.839717  2.506780 -1.041714  0.088141
2000-01-06  0.110624  0.396583  0.536703  0.962562
2000-01-07 -1.163584  0.153492  0.597990  0.946574
2000-01-08  1.681728 -1.789270 -0.125951 -0.050317

In [169]:
# selecting a list of columns 
df[['A', 'B']]

                   A         B
2000-01-01  0.791700 -0.685189
2000-01-02  0.198320 -1.191320
2000-01-03  0.655858  1.313179
2000-01-04  0.050410  1.363315
2000-01-05 -1.718382  3.023672
2000-01-06  0.231959  0.913475
2000-01-07 -1.042249  0.670385
2000-01-08  1.803062 -1.272377

In [170]:
df.loc[:,['B','A']]=df[['A','B']].values

In [171]:
df[['A','B']]

                   A         B
2000-01-01 -0.685189  0.791700
2000-01-02 -1.191320  0.198320
2000-01-03  1.313179  0.655858
2000-01-04  1.363315  0.050410
2000-01-05  3.023672 -1.718382
2000-01-06  0.913475  0.231959
2000-01-07  0.670385 -1.042249
2000-01-08 -1.272377  1.803062

In [172]:
sa=pd.Series([1,2,3], index=list('abc'))
dfa=df.copy()

In [173]:
sa.b

2

In [174]:
dfa.A

2000-01-01   -0.685189
2000-01-02   -1.191320
2000-01-03    1.313179
2000-01-04    1.363315
2000-01-05    3.023672
2000-01-06    0.913475
2000-01-07    0.670385
2000-01-08   -1.272377
Freq: D, Name: A, dtype: float64

In [175]:
panel.one

                   A         B         C         D
2000-01-01  0.791700 -0.685189  0.477730  0.468455
2000-01-02  0.198320 -1.191320 -1.319135 -2.081609
2000-01-03  0.655858  1.313179 -0.040808 -1.568859
2000-01-04  0.050410  1.363315  0.425948 -0.601308
2000-01-05 -1.718382  3.023672 -1.164024 -0.370949
2000-01-06  0.231959  0.913475  0.414393  0.503472
2000-01-07 -1.042249  0.670385  0.475680  0.487484
2000-01-08  1.803062 -1.272377 -0.248261 -0.509408

In [176]:
sa.a=5

In [177]:
sa

a    5
b    2
c    3
dtype: int64

In [178]:
dfa.A=list(range(len(dfa.index)))

In [179]:
dfa

            A         B         C         D
2000-01-01  0  0.791700  0.477730  0.468455
2000-01-02  1  0.198320 -1.319135 -2.081609
2000-01-03  2  0.655858 -0.040808 -1.568859
2000-01-04  3  0.050410  0.425948 -0.601308
2000-01-05  4 -1.718382 -1.164024 -0.370949
2000-01-06  5  0.231959  0.414393  0.503472
2000-01-07  6 -1.042249  0.475680  0.487484
2000-01-08  7  1.803062 -0.248261 -0.509408

In [180]:
dfa['A']=list(range(len(dfa.index)))

In [181]:
dfa

            A         B         C         D
2000-01-01  0  0.791700  0.477730  0.468455
2000-01-02  1  0.198320 -1.319135 -2.081609
2000-01-03  2  0.655858 -0.040808 -1.568859
2000-01-04  3  0.050410  0.425948 -0.601308
2000-01-05  4 -1.718382 -1.164024 -0.370949
2000-01-06  5  0.231959  0.414393  0.503472
2000-01-07  6 -1.042249  0.475680  0.487484
2000-01-08  7  1.803062 -0.248261 -0.509408

In [182]:
# it is also possible to assign a dict to a row to DataFrame:
x=pd.DataFrame({'x':[1,2,3], 'y':[3,4,5]})

In [183]:
x.iloc[1]=dict(x=9,y=99)

In [184]:
x

   x   y
0  1   3
1  9  99
2  3   5

In [185]:
s

2000-01-01   -0.685189
2000-01-02   -1.191320
2000-01-03    1.313179
2000-01-04    1.363315
2000-01-05    3.023672
2000-01-06    0.913475
2000-01-07    0.670385
2000-01-08   -1.272377
Freq: D, Name: A, dtype: float64

In [186]:
s[:5]

2000-01-01   -0.685189
2000-01-02   -1.191320
2000-01-03    1.313179
2000-01-04    1.363315
2000-01-05    3.023672
Freq: D, Name: A, dtype: float64

In [187]:
s[::2]

2000-01-01   -0.685189
2000-01-03    1.313179
2000-01-05    3.023672
2000-01-07    0.670385
Freq: 2D, Name: A, dtype: float64

In [188]:
s[::-1]

2000-01-08   -1.272377
2000-01-07    0.670385
2000-01-06    0.913475
2000-01-05    3.023672
2000-01-04    1.363315
2000-01-03    1.313179
2000-01-02   -1.191320
2000-01-01   -0.685189
Freq: -1D, Name: A, dtype: float64

In [189]:
s2=s.copy()

In [190]:
s2[:5]=0

In [191]:
s2

2000-01-01    0.000000
2000-01-02    0.000000
2000-01-03    0.000000
2000-01-04    0.000000
2000-01-05    0.000000
2000-01-06    0.913475
2000-01-07    0.670385
2000-01-08   -1.272377
Freq: D, Name: A, dtype: float64

In [192]:
df[:3]

                   A         B         C         D
2000-01-01 -0.685189  0.791700  0.477730  0.468455
2000-01-02 -1.191320  0.198320 -1.319135 -2.081609
2000-01-03  1.313179  0.655858 -0.040808 -1.568859

In [193]:
df.A[:2:-1]

2000-01-08   -1.272377
2000-01-07    0.670385
2000-01-06    0.913475
2000-01-05    3.023672
2000-01-04    1.363315
Freq: -1D, Name: A, dtype: float64

In [194]:
df1=pd.DataFrame(np.random.randn(5,4), columns=list('ABCD'), index=pd.date_range('20130101', periods=5))

In [195]:
df1

                   A         B         C         D
2013-01-01  0.633066 -2.090610 -0.958724 -0.000225
2013-01-02  0.326893 -0.844602  0.065505 -0.651938
2013-01-03 -0.439066  0.966938 -2.172675 -0.208810
2013-01-04 -0.970154  0.135421  0.496824  0.968861
2013-01-05 -1.189637 -0.005760 -0.195097 -1.278517

In [196]:
df1.loc['20130102': '20130104']

                   A         B         C         D
2013-01-02  0.326893 -0.844602  0.065505 -0.651938
2013-01-03 -0.439066  0.966938 -2.172675 -0.208810
2013-01-04 -0.970154  0.135421  0.496824  0.968861

In [197]:
df1=pd.DataFrame(np.random.randn(6,4), index=list('abcdef'), columns=list('ABCD'))

In [198]:
df1

          A         B         C         D
a  0.736964 -0.782553  0.516592 -0.727576
b  0.137798  1.488671  0.553406  2.232155
c -0.828360  0.691765 -0.442980 -1.207710
d -1.003347  0.542692  0.114773 -0.213621
e -0.579891  0.525143 -0.742965 -0.494203
f  1.549732 -0.096391 -0.381849  0.295363

In [199]:
df1.loc[['a','b','c','d'],:]

          A         B         C         D
a  0.736964 -0.782553  0.516592 -0.727576
b  0.137798  1.488671  0.553406  2.232155
c -0.828360  0.691765 -0.442980 -1.207710
d -1.003347  0.542692  0.114773 -0.213621

In [200]:
df1.loc['d':,'A':'C']

          A         B         C
d -1.003347  0.542692  0.114773
e -0.579891  0.525143 -0.742965
f  1.549732 -0.096391 -0.381849

In [201]:
df1.loc['a']

A    0.736964
B   -0.782553
C    0.516592
D   -0.727576
Name: a, dtype: float64

In [202]:
df1.loc['a']>0

A     True
B    False
C     True
D    False
Name: a, dtype: bool

In [203]:
df1.loc[:, df1.loc['a']>0]

          A         C
a  0.736964  0.516592
b  0.137798  0.553406
c -0.828360 -0.442980
d -1.003347  0.114773
e -0.579891 -0.742965
f  1.549732 -0.381849

In [204]:
s=pd.Series(list('abcdef'),index=[0,3,2,6,5,4])

In [205]:
s.loc[3:5]

3    b
2    c
6    d
5    e
dtype: object

In [206]:
s.sort_index()

0    a
2    c
3    b
4    f
5    e
6    d
dtype: object

In [207]:
s.sort_index().loc[1:5]

2    c
3    b
4    f
5    e
dtype: object

In [208]:
df1=pd.DataFrame(np.random.randn(6,4), index=list(range(0,12,2)),columns=list(range(0,8,2)))

In [209]:
df1

           0         2         4         6
0  -0.762597 -0.523771 -0.285843 -0.604483
2  -0.353601 -1.168710 -0.379083  0.669678
4  -1.907855 -1.161711  2.109277 -1.212523
6  -0.292704 -0.460246  2.860680 -1.013358
8  -2.080545  1.297989 -0.256470  0.427579
10 -0.785392  0.182351 -0.001575 -2.094370

In [210]:
df1.iloc[:3,2:4]

          4         6
0 -0.285843 -0.604483
2 -0.379083  0.669678
4  2.109277 -1.212523

In [211]:
df1.iloc[[1,3,5],[1,3]]

           2         6
2  -1.168710  0.669678
6  -0.460246 -1.013358
10  0.182351 -2.094370

In [212]:
df1.iloc[1,1]

-1.1687095681109501

In [213]:
df1.iloc[1]

0   -0.353601
2   -1.168710
4   -0.379083
6    0.669678
Name: 2, dtype: float64

In [214]:
df1=pd.DataFrame(np.random.randn(6,4), index=list('abcdef'), columns=list('ABCD'))

In [215]:
df1

          A         B         C         D
a  0.162633 -0.816287 -0.510849  0.252497
b  0.382769  0.378233  0.833645  0.144439
c -0.753084 -0.982781  0.482305 -1.381073
d -0.704083  1.286553 -0.017777 -0.451570
e -0.069151  2.086912  1.160253  1.309363
f  1.464354  0.597495 -1.631439  2.961824

In [216]:
df1.loc[lambda df:df.A>0, :]

          A         B         C         D
a  0.162633 -0.816287 -0.510849  0.252497
b  0.382769  0.378233  0.833645  0.144439
f  1.464354  0.597495 -1.631439  2.961824

In [217]:
df1.loc[:, lambda df:['A','B']]

          A         B
a  0.162633 -0.816287
b  0.382769  0.378233
c -0.753084 -0.982781
d -0.704083  1.286553
e -0.069151  2.086912
f  1.464354  0.597495

In [218]:
df1[lambda df:df.columns[2]]

a   -0.510849
b    0.833645
c    0.482305
d   -0.017777
e    1.160253
f   -1.631439
Name: C, dtype: float64

In [219]:
df1.A.loc[lambda s:s>0]

a    0.162633
b    0.382769
f    1.464354
Name: A, dtype: float64

In [220]:
df2=pd.DataFrame({'a':['one','one', 'two','two','two','three','four'],
                  'b':['x','y','x','y','x','x','x'],
                  'c':np.random.randn(7)})

In [221]:
df2

       a  b         c
0    one  x -0.005487
1    one  y -0.316653
2    two  x -1.181805
3    two  y -0.608614
4    two  x  1.906603
5  three  x -0.123638
6   four  x -1.575480

In [222]:
df2.duplicated('a', keep=False)

0     True
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [223]:
df2.drop_duplicates('a')

       a  b         c
0    one  x -0.005487
2    two  x -1.181805
5  three  x -0.123638
6   four  x -1.575480

In [224]:
df2.drop_duplicates('a',keep='last')

       a  b         c
1    one  y -0.316653
4    two  x  1.906603
5  three  x -0.123638
6   four  x -1.575480

In [225]:
df2

       a  b         c
0    one  x -0.005487
1    one  y -0.316653
2    two  x -1.181805
3    two  y -0.608614
4    two  x  1.906603
5  three  x -0.123638
6   four  x -1.575480

In [228]:
df2.duplicated(['a','b'])

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool